---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfigurationInfo
source: html/3912030b-b1af-8856-2ace-f6ceeb369cec.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfigurationInfo Method

Gets the information about the fabrication configuration of the project.

## Syntax (C#)
```csharp
public FabricationConfigurationInfo GetFabricationConfigurationInfo()
```

## Returns
The information about the fabrication configuration of the project.